---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateOpeningCutOut
source: html/f3834d18-c972-1291-cb0b-2f707169e78c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateOpeningCutOut Property

Can't create Opening cut.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateOpeningCutOut { get; }
```